# SpatialElementGeometryCalculator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpatialElementGeometryCalculator Properties
SpatialElementGeometryCalculator Class See Also
---
The SpatialElementGeometryCalculator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace